#include<stdio.h>
#include<string.h>
//转义字符
//int main() {
//	//这段字符串中\\->\,\32的10进制数是26，\t是制表符,\n
//	//\123代表8进制数 \x12代表16进制数
//	printf("c:\\test\1018\test.c\n");
//	printf("%d\n", strlen("c:\\test\1018\test.c\n"));
//	return 0;
//}

//按位取反操作符 ~ 左移操作符<< 右移操作符>>
//int main() {
//	int a = 0;
//	//输出为-1
//	//a是int类型的，内存大小事4byte，由4*8=32个bit位存储
//	//故0对应的2进制数是00000000 00000000 00000000 00000000
//	//第一个0代表的是符号位，如果位1则为负数
//	//~将所有的0变为1，即11111111 11111111 11111111 11111111
//	//最高位是1，可知是负数。内存中存储的是一个数的补码
//	//正数的原反补码相同，负数不同
//	//从补码到反码需要最后一位-1，变为11111111 11111111 11111111 11111110
//	//由反码到补码 符号位不变，其他位取反得到 10000000 00000000 00000000 00000001
//	//该值对应的数是-1，所以~a=-1
//	printf("%d\n", ~a);
//	//左移操作符<<将二进制数整体左移一位末尾处补0 可以得出还是为0 右移同理
//	printf("%d\n", a << 1);
//	printf("%d\n", 1 >> 1);
//	return 0;
//}

//--操作符 ++操作符
int main() {
	int a = 0;
	int b = 0;
	//前置++是先+1然后再使用 最后结果为b=1 a=1
	/*b = ++a;*/
	//后置++是先使用然后再+1 最后结果是b=0 a=1
	b = a++;
	printf("%d\n", b);
	printf("%d\n", a);
	return 0;
}